# API vs Library vs Framework

## API

- 응용 프로그램에서 운영체제나 프로그래밍 언어가 제공하는 기능을 제어할 수 있게 만든 인터페이스
- 컴포넌트(재사용이 가능한 가각의 독립된 모듈)를 사용하는 규약
- 구현 로직 없음
- API를 사용하면 구현 방식을 알지 못해도 제품 또는 서비스가 서로 커뮤니케이션할수 있으며 애플리케이션 개발을 간소화하여 시간과 비용을 절약할 수 있다.

## LIbrary

- 소프트웨어 개발 시 사용되는 프로그램의 구성요소로,공통으로 사용될 수 있는 특정한 기능을 모듈화한 것이다.
- 구현 로직이 있다.
- 컴포넌트 자체이다.
- 개발자가 코드를 컨트롤하고 라이브러리를 부른다.

## Framework

- 응용프로그램이나 소프트웨어의 솔루션 개발을 수월하게 하기위해 제공된 소프트웨어 환경
- 누군가가 만든 규칙을 따라 코딩한다
- 프레임워크가 개발자가 작성한 코드를 호출한다.(프레임워크 틀 안에서 개발자가 작성한 코드를 사용)
